import 'package:flutter/material.dart';

class MultiSelectableButtonList extends StatefulWidget {
  const MultiSelectableButtonList({Key? key}) : super(key: key);

  @override
  _MultiSelectableButtonListState createState() =>
      _MultiSelectableButtonListState();
}

class _MultiSelectableButtonListState extends State<MultiSelectableButtonList> {
  List<String> selectedButtons = [];
  List<String> menClothes = [
    //เสื้อผ้าผู้ชาย
    "ทั้งหมด",
    "กางเกงยีนส์",
    "เสื้อฮู้ดดี้",
    "สเวตเตอร์และคาร์ดิแกน",
    "เสื้อแจ็คเกตและเสื้อโค้ท",
    "สูท",
    "กางเกงขายาว",
    "กางเกงขาสั้น",
    "เสื้อ",
    "ชุดชั้นในชาย",
    "ชุดนอน",
    "ชุดเซ็ต",
    "ชุดพื้นเมืองชาย",
    "คอสเพลย์",
    "ยูนิฟอร์ม",
    "อื่นๆ",
    "ถุงเท้า"
  ];
  List<String> womenClothes = [
    //เสื้อผ้าผู้หญิง
    "ทั้งหมด",
    "เสื้อฮู้ดและ เสื้อสเวตเชิ้ต",
    "ชุดเซ็ต",
    "ชุดชั้นใน",
    "ชุดนอน",
    "เสื้อผ้าคนท้อง",
    "เสื้อพื้นเมือง",
    "ชุดแต่งกาย",
    "อื่นๆ",
    "ถุงเท้า และถุงน่อง"
  ];
  List<String> accessories = [
    //เครื่องประดับ
    "ทั้งหมด",
    "แว่นตา",
    "เครื่องประดับผม",
    "เครื่องประดับอื่นๆ",
    "โลหะมีค่าเพื่อการลงทุน",
    "แหวน",
    "ต่างหู",
    "กำไลข้อเท้า",
    "สร้อยคอ",
    "เซ็ตเครื่องประดับ",
    "ผ้าพันคอและผ้าคลุมไหล่",
    "ถุงมือ",
    "กำไลข้อมือ",
    "หมวก",
    "เข็มขัด",
    "เนคไท, หูกระต่าย",
    "อื่นๆ"
  ];
  List<String> homeAppliances = [
    // "เครื่องใช้ไฟฟ้าภายในบ้าน",
    "ทั้งหมด",
    "โปรเจคเตอร์และ อะไหล่",
    "เครื่องใช้ไฟฟ้าขนาดเล็กภายในบ้าน",
    "เครื่องใช้ไฟฟ้าขนาดใหญ่",
    "ทีวีและ อุปกรณ์ที่เกี่ยวข้อง",
    "เครื่องใช้ไฟฟ้าในครัว",
    "แผงวงจรและ อะไหล่",
    "แบตเตอรี่",
    "รีโมต คอนโทรล",
    "อื่นๆ"
  ];

  List<String> womenShoes = [
    //"รองเท้าผู้หญิง",
    "ทั้งหมด",
    "รองเท้าบูท",
    "รองเท้าผ้าใบ",
    "รองเท้าส้นแบน",
    "รองเท้าส้นสูง",
    "รองเท้าส้นตึก",
    "รองเท้าแตะ",
    "ผลิตภัณฑ์และอุปกรณ์เสริมสำหรับรองเท้า",
    "อื่นๆ"
  ];

  List<String> menShoes = [
    //"รองเท้าผู้ชาย",
    "ทั้งหมด",
    "รองเท้าบูท",
    "รองเท้าผ้าใบ",
    "รองเท้าผ้าใบแบบสวมและรองเท้าเปิดส้น",
    "รองเท้าโลฟเฟอร์",
    "รองเท้าหนังแบบผูกเชือก",
    "รองเท้าแตะ",
    "อุปกรณ์เสริมสำหรับรองเท้า",
    "อื่นๆ"
  ];
  List<String> electronics = [
    //มือถือและอุปกรณ์เสริม
    "ทั้งหมด",
    "ซิมการ์ด",
    "แท็บเล็ต",
    "โทรศัพท์มือถือ",
    "อุปกรณ์สวมใส่",
    "อุปกรณ์เสริม",
    "วิทยุสื่อสาร",
    "อื่นๆ"
  ];
  List<String> muslimClothing = [
    //เสื้อผ้ามุสลิม
    "ทั้งหมด",
    "เสื้อผ้ามุสลิมผู้หญิง",
    "เสื้อผ้ามุสลิมผู้ชาย",
    "เสื้อผ้ามุสลิมเด็ก",
    "เสื้อชั้นนอก",
    "ชุดเซ็ต",
    "อื่นๆ"
  ];
  List<String> travelGear = [
    //"กระเป๋าเดินทาง",
    "ทั้งหมด",
    "กระเป๋าเดินทางล้อลาก",
    "กระเป๋าสำหรับเดินทาง",
    "อุปกรณ์เสริมสำหรับเดินทาง",
    "อื่นๆ"
  ];
  List<String> womenBags = [
    //"กระเป๋าผู้หญิง",
    "ทั้งหมด",
    "กระเป๋าเป้",
    "กระเป๋าคอมพิวเตอร์",
    "คลัทช์ & กระเป๋าคล้องมือ",
    "กระเป๋าคาดอก",
    "กระเป๋าผ้า",
    "กระเป๋าถือ",
    "กระเป๋าสะพายข้าง",
    "กระเป๋าสตางค์",
    "อุปกรณ์เสริมกระเป๋า",
    "อื่นๆ"
  ];
  List<String> menBags = [
    // "กระเป๋าผู้ชาย",
    "ทั้งหมด",
    "กระเป๋าเป้",
    "กระเป๋าคอมพิวเตอร์",
    "กระเป๋าผ้า",
    "กระเป๋าเอกสาร",
    "คลัทช์",
    "กระเป๋าคาดอก",
    "กระเป๋าสะพายข้าง",
    "กระเป๋าสตางค์",
    "อื่นๆ"
  ];
  List<String> watches = [
    // "นาฬิกา",
    "ทั้งหมด",
    "นาฬิกาผู้หญิง",
    "นาฬิกาผู้ชาย",
    "นาฬิกาคู่",
    "อุปกรณ์เสริมสำหรับนาฬิกา",
    "อื่นๆ"
  ];
  List<String> audioEquipment = [
    // "เครื่องเสียง",
    "ทั้งหมด",
    "หูฟัง",
    "เครื่องเล่นวิดีโอ, เสียง และเครื่องบันทึกเสียง",
    "ไมโครโฟน",
    "เครื่องขยายเสียง และ มิกเซอร์",
    "เครื่องเสียงภายในบ้าน",
    "สายเคเบิลและอุปกรณ์แปลงสัญญาณ",
    "อื่นๆ"
  ];

  List<String> gamingEquipment = [
    //"เกมและอุปกรณ์เสริม",
    "ทั้งหมด",
    "เครื่องเกม",
    "อุปกรณ์เสริมเกม",
    "แผ่นและตลับเกม",
    "อื่นๆ"
  ];

  List<String> camerasAndDrones = [
    //"กล้องและโดรน",
    "ทั้งหมด",
    "กล้อง",
    "กล้องวงจรปิด",
    "เลนส์",
    "อุปกรณ์เสริมเลนส์",
    "อุปกรณ์เสริมกล้อง",
    "อุปกรณ์ดูแลกล้อง",
    "โดรน",
    "อุปกรณ์เสริมโดรน",
    "อื่นๆ"
  ];
  List<String> homeObject = [
    // "เครื่องใช้ในบ้าน",
    "ทั้งหมด",
    "เทียนหอม และน้ำมันหอมระเหย",
    "ห้องน้ำ",
    "ห้องนอน",
    "อุปกรณ์ตกแต่งบ้าน",
    "เครื่องอุ่นมือ ถุงน้ำร้อน และถุงน้ำแข็ง",
    "เฟอร์นิเจอร์",
    "สวน",
    "เครื่องมือและอุปกรณ์ปรับปรุงบ้าน",
    "อุปกรณ์ซักรีดและผลิตภัณฑ์ดูแลบ้าน",
    "เครื่องครัว",
    "เครื่องใช้บนโต๊ะอาหาร",
    "โคมไฟและอุปกรณ์ให้แสงสว่าง",
    "อุปกรณ์รักษาความปลอดภัย",
    "อุปกรณ์สำหรับจัดเก็บ",
    "อุปกรณ์งานปาร์ตี้",
    "สินค้าเกี่ยวกับฮวงจุ้ยและศาสนา",
    "อื่นๆ"
  ];
  List<String> outdoorSports = [
    // "กีฬาและกิจกรรมกลางแจ้ง",
    "ทั้งหมด",
    "อุปกรณ์เล่นกีฬาและกิจกรรมกลางแจ้ง",
    "รองเท้ากีฬา",
    "เสื้อผ้ากีฬา",
    "อุปกรณ์เสริมสำหรับเล่นกีฬาและกิจกรรมกลางแจ้ง",
    "สินค้าอื่นๆ"
  ];
  List<String> stationery = [
    // "เครื่องเขียน",
    "ทั้งหมด",
    "อุปกรณ์ห่อของขวัญ",
    "อุปกรณ์การเขียนและลบคำผิด",
    "อุปกรณ์สำนักงานและโรงเรียน",
    "อุปกรณ์ศิลปะ",
    "สมุดโน๊ตและกระดาษ",
    "จดหมายและซองจดหมาย",
    "สินค้าอื่นๆ"
  ];
  List<String> hobbiesAndCollectibles = [
    // "งานอดิเรกและของสะสม",
    "ทั้งหมด",
    "ของสะสม",
    "ของที่ระลึก",
    "ของเล่นและเกม",
    "ซีดี ดีวีดี",
    "เครื่องดนตรีและอุปกรณ์เสริม",
    "แผ่นเสียง",
    "อัลบั้มรูป",
    "งานปัก",
    "อื่นๆ"
  ];
  List<String> booksAndMagazines = [
    // "หนังสือและนิตยสาร",
    "ทั้งหมด",
    "นิตยสารและหนังสือพิมพ์",
    "หนังสือ",
    "หนังสืออิเล็กทรอนิกส์",
    "อื่นๆ"
  ];
  List<String> computersAndAccessories = [
    //"คอมพิวเตอร์และอุปกรณ์เสริม",
    "ทั้งหมด",
    "คอมพิวเตอร์แบบตั้งโต๊ะ",
    "หน้าจอคอมพิวเตอร์",
    "อุปกรณ์คอมพิวเตอร์",
    "อุปกรณ์เก็บข้อมูล",
    "อุปกรณ์เน็ตเวิร์ก",
    "โปรแกรมคอมพิวเตอร์",
    "เครื่องใช้สำนักงาน",
    "ปริ้นเตอร์และอุปกรณ์เสริม",
    "อุปกรณ์ต่อพ่วงและอุปกรณ์เสริม",
    "คีย์บอร์ดและเมาส์",
    "แล็ปท็อป",
    "อื่น ๆ"
  ];

  void toggleButton(String value) {
    setState(() {
      if (selectedButtons.contains(value)) {
        selectedButtons.remove(value);
      } else {
        selectedButtons.add(value);
      }
    });
  }

  @override
  Widget build(BuildContext context) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Wrap(
          children: [
            for (String item in menClothes)
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: ElevatedButton(
                  onPressed: () {
                    toggleButton(item);
                  },
                  style: ButtonStyle(
                    backgroundColor: selectedButtons.contains(item)
                        ? MaterialStateProperty.all<Color>(Colors.greenAccent)
                        : null,
                  ),
                  child: Text(item),
                ),
              ),
          ],
        ),
        const SizedBox(height: 16),
        Text(
          'ปุ่มที่ถูกเลือก: ${selectedButtons.join(", ")}',
          style: const TextStyle(fontSize: 16),
        ),
      ],
    );
  }
}
